import Header from "../../components/layout/Header/Header";
import Footer from "../../components/layout/Footer/Footer";
import Container from "../../components/ui/Container/Container";
import "./About.scss";

export default function About() {
  return (
    <div className="about-page">
      <Header />

      <main className="about-content">
        <Container>
          <div className="about-card">

            <h1>درباره سامانه راه نیک</h1>

            <section>
              <h2>کمک‌رسانی هدفمند به نیازمندان واقعی</h2>


              <p>
                در راه نیک نیازمندی‌های تأیید شده‌ای وجود دارد که افراد
                توانمند می‌توانند از بین آن‌ها انتخاب کنند، مبلغ معادل را پرداخت کنند و پیگیری کنند
                که کمک آن‌ها چگونه به دست نیازمندان می‌رسد.
              </p>

              <p>
                همچنین امکان جمع‌آوری کمک از طریق شبکه دوستان و آشنایان (گلریزون) نیز فراهم شده است
                تا مبلغ مورد نیاز به صورت تدریجی جمع‌آوری شود.
              </p>
            </section>

            <section>
              <h2> پلت‌ فرم هوشمند راه نیک</h2>

              <p>
                 یک پلت‌فرم است؛ یعنی هم مؤسسات خیریه از امکانات آن استفاده می‌کنند و هم افراد
                توانمند می‌توانند نیازهای مختلف را مشاهده کرده و برای رفع آن‌ها اقدام کنند.
              </p>

              <p>
                کمک‌ها می‌توانند به شکل‌های مختلف انجام شوند:
              </p>

              <ul>
                <li> خدمت</li>
                <li>پرداخت نقدی کل مبلغ</li>
                <li>پرداخت بخشی از مبلغ</li>
                <li>جمع‌آوری کمک از طریق گلریزون</li>
              </ul>

              <p>
                نیازها توسط خیریه‌های عضو بررسی و ثبت می‌شوند تا افراد بتوانند متناسب با توانایی
                خود بهترین گزینه را انتخاب کنند.
              </p>
            </section>

            <section>
              <h2>راه‌حلی امروزی برای کمک‌رسانی</h2>

              <p>
                همه ما می‌دانیم بسیاری از هم‌وطنان در شرایط دشواری زندگی می‌کنند و هر کدام از ما
                وظیفه داریم تا حد توان به آن‌ها کمک کنیم.
              </p>

              <p>
                هدف ما رقابت با خیریه‌ها نیست، بلکه کمک به آن‌ها برای افزایش اثرگذاری
                و ایجاد یک شبکه هوشمند کمک‌رسانی است.
              </p>

            </section>

          </div>
        </Container>
      </main>

      <Footer />
    </div>
  );
}
